{"FBI_38": "On 3 December, 2004 this office received a letter from a person who signed his name \"Juan\". This letter, having no return address, was mailed from a post office in Farmers Branch, TX. Like the letter sent to the Houston field office, this one said that a Type A strain of foot and mouth disease was brought into the USA by persons who had traveled from Cartagena, Columbia, to Guane, Cuba, to Ciudad Madero, Mexico, to Ciudad Acuna, Mexico, and then on to Victoria, TX. The letter closed by saying that this strain of FMD was a \"little greeting\" from FARC and the ELN..\n", "NSA_03": "Intercepted phone call from Paris to Ojinaga, Mexico. The Paris call originated from # 12 Rue De Civry; the Ojinaga location is a pay phone at the Cabrito Hotel. In part of the message, in Arabic, the caller says: \"...we will let you know when S and R can make a safe passage north...\"..\n", "NSA_12": "Intercepted phone call from Calamar, Columbia to Ojinaga, Mexico. The caller was using a pay phone at the Los Palmas Hotel in Calamar. The receiver was at a pay phone in the Cabrito Hotel.in Ojinaga. In a brief message the caller said: \"Expect Jose and Carlos on May first. Don't let them go north until you hear from us.\" The receiver replies: \"I know there has been trouble. But you must send us more money to cover expenses.\"..\n", "NSA_13": "Intercepted phone call from Bogota, Columbia to Tampico, Mexico. The call originated from a pay phone in the Los Andes Hotel in Bogota; the receiver of the call was at a residence at 555 La Mirada St. in Tampico. The caller began by saying [in Spanish]: \"As you have heard, our Arab friends need to find a new way north. We hear that Chetumal may not be good any more. Can you recommend another stopover?\" The recipient of the call replies: \"Yes, we have given this some thought and recommend you try Ciudad Madero. We are close by and can provide help. This will also make the route to Ojinaga shorter. Will we have access to the same funds?\" The reply was \"Yes, of course. This sounds very good.\"..\n", "NSA_15": "Intercepted phone call on 12 September, 2004 from Tehran, Iran to Tampico, Mexico. The caller was at a phone in the Cultural Ministry in Tehran; the receiver of the call was at 555 La Mirada St. in Tampico. The caller says [in Pharsi]: \"Our Crusader enemies have a saying 'Diamonds are a girl's best friend'. Do you understand what I mean?\" The receiver says: \"I understand completely. They will be our best friends too.\"..\n", "NSA_17": "Intercepted phone call from Bogota, Columbia to Tampico, Mexico. The call originated from a pay phone in the Los Andes Hotel in Bogota; the receiver of the call was at a residence at 555 La Mirada St. in Tampico. The caller said [in Spanish]: \"Your first two guests will arrive on the tenth of this month at the new place. Make sure you tell them to avoid going north through Piedras Negras. We believe Rinaldo and Carlos have been caught.\" The reply is: \"We will send them through Cuidad Acuna. The other place looks bad too.\"..\n", "NSA_19": "Intercepted phone call on 15 November, 2004 from Bogota, Columbia to Tampico, Mexico. The call originated from a pay phone in the Los Andes Hotel in Bogota; the receiver of the call was at a residence at 555 La Mirada St. in Tampico. The person at the residence has now been identified as a Saudi named Riyad Said. He has been using the alias \"Jose Ramirez\". In this call the caller says [in Spanish]: \"What happened to your two guests who arrived a few weeks ago?\" The reply was: \"They made it just fine and the new route works great. I heard from them two days ago and they have made their destinations up north.\"..\n", "NSA_21": "Intercepted phone call on 28 November, 2004 from Bogota, Columbia to Cuidad Acuna, Mexico. The call originated from a pay phone in the Los Andes Hotel in Bogota; the receiver of the call was at a residence at 112 Ave. Zaragoza in Ciudad Acuna. The caller says [in Spanish]: \"The next time you talk to your boys up north, tell them to make sure they get their stories straight.\" The person receiving the call says: \"Don't worry, they know what they are supposed to do.\"..\n"}