{"CIA_04": "This source reports observing, near Calamar on 3 March, 2003, three men he knew were Cubans discussing the transfer of cocaine with members of the National Liberation Army [ELN] in Columbia. The source recognized one of these Cubans as Jose Escalante. This source says that he knew Escalante when they were students in 1991 at a school for medical laboratory technicians in Havana. This source said he believes that Escalante works in some capacity for the Cuban military. Our source also stated that Cuban representatives frequently visit in the tri-border area of Columbia, Ecuador and Peru to arrange for the exchange of weapons of various sorts needed by ELN for cocaine, that the ELN supplies to the Cubans who sell and distribute this narcotic throughout the Caribbean and Central American region..\n", "CIA_10": "In response to our query about other associates of Omar Mahmoud Othman at the Baker St. Mosque in London, MI 5 responded with information that a man named Omar Hanif had been given employment by Othman at this mosque in the period 1993 - 1998. He left the UK for a year in 1999 and was possibly in Afghanistan. Travel records show that he traveled from London Heathrow to Islamabad in February of 1999 and returned to London from there in December, 1999. Hanif holds a valid British passport and now lives at #11 Apple St. in Nassau, The Bahamas. He is employed by a chain of hotels in the Bahamas and works at the Seashore Hotel in Nassau and, occasionally, at the Freeport Star Hotel in Freeport. Another name mentioned by MI 5 to be associated with Othman was Jamal al Quso, who came to the UK from Yemen in 1993. He applied for British citizenship in 1998 but was refused because of his repeated troubles with the law. He was convicted of inciting to riot in 1996 and served a one-year suspended sentence. Records reveal that he left London Heathrow on a flight to Chicago, Illinois on July 17, 1999..\n", "CIA_18": "Further information was requested on Muslih Odeh, who was mentioned in an NSA report of 15 September, 2003. MI 6 reported that Muslih Odeh is believed to be a Saudi and is not a British citizen. Saudi Intelligence reported that a Muslih Odeh was born in Jeddah in 1967 and was last recorded as living in Saudi Arabia in Riyadh in 1998..\n", "CIA_20": "A paid source in Chitral said he was treated on about 2 October, 2003 for a broken arm by a Dr. Badawi in a refugee camp outside Chitral. Asked how he knew it was a Dr. Badawi, the source replied that another refugee had told him who this doctor was..\n", "CIA_24": "Surveillance of Omar Hanif reveals that he traveled from Nassau, The Bahamas to Cairo, Egypt on 20 December, 2003 and returned on 25 December, 2003. While in Cairo he was photographed coming out of a shop at 411 Ramses St. in Cairo. He was in the company of two other men. Provided with this photo, we were able to identify one of the two men as Saeed Hasham..\n", "CIA_26": "Surveillance continues on Omar Hanif in Nassau, The Bahamas. On 4 February, 2004 Hanif took a flight from Nassau to Miami, FL. where he boarded a flight to London, arriving on 5 February. He then took a connecting flight to Karachi, Pakistan, returning by the same route on 7 February. While in Karachi, Hanif stayed at a residence at 631 Nishtar Rd. This house is now under surveillance by Pakistani Intelligence..\n", "CIA_32": "Further information provided by MI 5 regarding Muslih Odeh [see CIA Report: 25 September, 2003]. MI 5 reports that there is no record of Odeh's having a British passport, but he may have a Saudi passport. He is known to be employed by the Freeport Star Hotel in Freeport, The Bahamas and is currently under surveillance..\n", "CIA_39": "Our source has now been employed by the Holland Orange Shipping Lines in Casablanca. He has been assigned to keep track of the activities of Abdellah Atmani. This source says that on 5 October, 2004 Atmani had a visitor wearing the uniform of a First Officer of Central Russia Airlines. This person gave Atmani a carefully wrapped package marked [in Russian] \"Antibiotics\". The source says that Atmani told the officer that he should tell his boss that this package will be aboard the \"Dutch Courage\" in good time. Later the same day, this source says he observed Atmani placing a Holland Orange shipping label on this package to an address in Santo Domingo, The Dominican Republic. The source could not see the street address to which this package would be sent..\n", "CIA_41": "Additional information was requested on 2 November, 2004 of the source who reported on the activities of Pyotr Safrygin on 1 September, 2004 [see CIA Report for 15 September, 2004]. This source was asked if he recognized the person at the farm house from whom Safrygin had received the package marked \"antibiotics\". This source said he did not recognize the person at the farm house, but said he later learned that the farm house was owned by a scientist at Vector..\n", "CIA_42": "This source, assigned to cover the activities of Omar Hanif, reported that on 1 December, 2004 he had followed Hanif as he took an inter-island ship called the \"Packet\" from Nassau to Freeport in the Bahamas. Hanif was carrying a package that the source said carried a label in what he thought was Russian [but which he could not translate]. The source followed Hanif to the Freeport Star Hotel where, in the hotel's parking lot, he gave the package to a person named Muslih Odeh, who is also under surveillance. The source said that Odeh placed the package in the trunk of a car and immediately drove off..\n","CIA_43": "Received information from a source following Omar Hanif that yesterday [15 December, 2004], Hanif met two men as they departed from the cruise ship \"Viking Holiday\". The source said that Hanif had taken these men to his residence at 11 Apple St. in Nassau..\n","FBI_02": "Riyad Yasser, a UK citizen, was arrested on 1 May, 2003 following an accident on the M4 Motorway near the Heston Service Area outside of London. Yasser has been an air traffic controller at Heathrow Airport for the past six years. Two kilos of Semtex were found in the trunk of his car. A videocassette of a sermon given by Omar Mahmoud Othman, formerly a Salafi jihad preacher at the Baker St. Mosque in London, was found in Yasser's apartment at # 44, Northumberland Circle, East Bedfont, London. Also found in Yasser's apartment was a note containing several addresses in Canada, the USA, and in Nassau in the Bahamas. The addresses are: 721 St. Clare St., Montreal; 455 11th Street, Miami Beach, FL; 1712 Ferry Ave., Camden, NJ, and 11 Apple St. in Nassau, The Bahamas..\n","FBI_04": "A man using an Illinois driver's license in the name Abu Hafs, address 2211 Cermak Rd.. in Chicago, rented a car at the Drexel Car Rental Agency in Chicago on 27 September, 2003. This car was never returned to the Drexel agency. It was found abandoned in a parking lot at O'Hare Airport on 2 October, 2003. On 27 April a roundtrip airline ticket to Hobby Airport in Houston, Texas was issued by Central States Airline at O'Hare Airport to a man who gave his name as Mehdi Rafiki. Rafiki paid for this ticket in cash and used as identification a French passport in the name Mehdi Rafiki..\n","FBI_12": "A tip from an anonymous source directed investigators to a residence at 2111 Troost Ave. in Kansas City, Missouri. This source said that explosives were being manufactured at this residence by some terrorists who intended to blow up several buildings in the Kansas City Area. A warrant was obtained to search this residence on evidence provided by an examination of items found in garbage sacks that were picked up by an FBI officer posing as a garbage collector. Traces of chemicals necessary to produce explosives were found on items in this garbage. When this residence was searched on 22 December, 2003, one man, who gave his name as Walter Smith, was the only person at home. While the investigation was proceeding, another man entered and was apprehended. Subsequent identity checks revealed this man to be Jamal al Quso, who had come from Chicago to Kansas City. What was found at this residence were batches of hexamethylene triperoxide diamine [HMTD] and cyclotrimethylene trinitramine [RDX], both primary explosives. Also found were three garbage sacks full of urea and aluminum sulfate. In later investigations of this residence, detailed drawings were found of three popular casinos in the Kansas City area: the Argosy Riverside Casino, the Isle of Capri Casino, and Harrah's Casino..\n","FBI_37": "On 1 December, 2004 this office received in the mail a letter signed \"Ramon\". This letter was mailed from a post office at Gulfgate in Houston but carried no return address. The letter said that a stain of Type A foot and mouth disease was now in Texas and that cattlemen around Victoria, TX would be the first to suffer. The note also said that members of FARC had traveled from Cartagena, Columbia to Guane, Cuba, to Chetumal, Mexico, to Piedras Negras, Mexico, and then to Victoria, TX..\n","FBI_40": "An official of the Majestic Lines, a tourist ship lines reported to us an observation made on 29 November, 2004 by one of their booking agents. She said that two men with Middle Eastern names had booked two tours on the same ship for tours that left just a month apart. The first tour, aboard the \"Majestic Clipper\", left Miami on 15 November, 2004 for Nassau, The Bahamas, and returned from Nassau to Miami on 21 November, 2004. The second tour would leave Miami for Nassau on 13 December, 2004 and return from Nassau to Miami on 19 December, 2004. The two persons booking these tours on 20 September, 2004 were Said Khadr and Muhammed Dandani. Both held U.S. passports. They were booked for first-class accommodations on the \"Majestic Clipper\" for both of these tours. Khadr and Dandani took the first tour and are aboard the second..\n","FBI_41": "In light of the information in FBI report for 13 December, 2004, an immediate check was made of other cruise ship lines to see if there were other occurrences of such double bookings by Middle Eastern persons. Positive replies were obtained from the Royal Norwegian Lines in New York City and the Sea Aire Lines in Baltimore, MD. Royal Norwegian Lines reported that two men named Wali Shakur and Hamza al Midhar had, on 20 September, 2004, booked first-class accommodations on the \"Viking Holiday\" that left NYC on 14 November, 2004 and returned to NYC from Nassau on 21 November, 2004. These same two men had booked first-class accommodations on the same ship that left NYC for Nassau on 12 December, 2004 and is due to arrive back in NYC on 19 December, 2004. This cruise ship leaves Nassau on 18 December, 2004. The Sea Aire Lines reported the following information. Two men named Mounir Mzoudi and Mamoun Zammar had, on 21 September, 2004 booked two first-class accommodations on the \"Caribbean Queen\". The first was for a tour that left Baltimore for Freeport, The Bahamas on 7 November, 2004 and returned to Baltimore on 14 November, 2004. The second was for a tour on the \"Caribbean Queen\" that left Baltimore for Freeport on 12 December, 2004 and is due to arrive back in Baltimore on 19 December, 2004. This ship leaves Freeport on 17 December, 2004..\n","NSA_06": "Intercepted phone call on 5 September, 2003 from a location in Nassau to one in Freeport in the Bahamas. The Nassau location is: # 11 Apple St. and the Freeport location is 1789 Grenfel Ave. The resident at the Nassau address is named Omar Hanif; the resident at the Freeport address is named Muslih Odeh. In part of this message the caller says: \"Do you remember the meeting I went to in Karachi last March? I am going to offer you a promotion, will you accept it?\" The reply is: \"Yes, of course.\"..\n","USCBP_01": "On 3 August, 2004 two men were apprehended at the Longhorn Motel in Carrizo Springs, TX. The motel owner, Mike Sanders, said he became suspicious of the two because of the identification they presented when they registered at his motel on 2 August, 2004. One of the men presented a Texas driver's license having a picture that seemed fuzzy. In addition, they listed a Texas car license as KHZ - 116. Sanders allowed the men to stay but made note of the address on the driver's license: 2233 Fannin St. in Uvalde, TX. Sanders informed the USCBP office in Laredo who verified that there is no such address in Uvalde, TX. In addition, there was no car in the motel's parking lot having the license plate KHZ - 116. When interviewed by USCPB officers, one of the men said their car had obviously been stolen from the motel's parking lot. Most probably, the two men had crossed the border in the vicinity of Piedras Negras and Eagle Pass. They were held for questioning. Examination of their luggage revealed several documents written in Arabic, that included instructions about how to make sarin gas and ricin..\n","USCBP_02": "A routine customs inspection was performed on a package that was sent by a person named Pieter Dopple, 22 Hoveniersstraat, Antwerp, Belgium. This package was addressed to A. Hijazi, 1212 Lyons Ave., Newark, NJ. The customs form stated that this package contained two decorative clocks having a commercial value of $250.00. The package instead contained 111 polished diamonds, whose value is estimated to be $47,000. Discussions with the FBI resulted in a decision not to pursue a customs violation charge against HIjazi. The reason is that HIjazi is currently under FBI surveillance. This package was resealed and delivered to HIjazi by USPS..\n"}