{"CIA_09": "This source reported that over 500 carats of polished diamonds were traded by an organization representing rebel forces in Liberia for an assortment of weapons. The person acquiring the diamonds from this organization was identified only as an Arab businessman who had done such trading in the past. This person requested that these diamonds be sent to an address in Panama City, Panama, which he gave as: 993 Panamico Ave. The package, to be delivered to a Ramundo Ortiz at this address, was to be marked for customs purposes as art objects having a commercial value of $250.00..\n", "CIA_14": "Biographical information was requested on Ramundo Ortiz in Panama City. Records reveal that Ortiz runs a business that deals with art objects as well as precious stones. He is known to be an expert evaluator of diamonds and tanzanites. His business is located at 993 Panamico Ave in Panama City. He travels extensively throughout Central and South America. He is also known to have traveled to Havana, Cuba on many occasions. He is known not to be associated with narcotics traffic in any way. He appears quite prosperous and supports many local charities. But it is also known that he does business with a variety of clients in Africa and the Middle East, especially in Iran and Pakistan..\n", "CIA_25": "A check on the activities of Ramundo Ortiz reveals that on 27 January, 2004 he sent a wire transfer of $150,000 in Cuban pesos from the Canal Bank in Panama City to the Peoples Bank in Havana, Cuba. This transfer was to an account held by Jose Escalante at the Peoples Bank..\n", "CIA_29": "The Itar-Tass news Agency reported that, on 15 April, 2004, cattle in the city of Blagoveshchensk were found to have foot and mouth disease. One thousand cattle have already been slaughtered. A state of emergency has been declared in six districts of the Amur region..\n", "CIA_31": "Further information about the background of Boris Bugarov is provided. From information gathered some time ago from Russian sources, Bugarov was born in 1950 in the town of Saratov and was trained in biology at Moscow State University. He appears to have joined the Vector institute around 1986 and he became an expert in developing aerosolized forms of biological weapons. It is believed Bugarov worked on aerosolized forms of India-1 smallpox and pneumonic plague. More recent sources say that Bugarov went to Cuba but then returned to Moscow sometime in 1992. He is reported to have divorced his wife in 1993 and has returned to Cuba. However, he still travels frequently to Europe, the Middle East and in South America. It is also known that Cuba has an active biological weapons program..\n", "FBI_15": "Jamal al Shibh, of Yemeni origin, has been the Imam at the Tawhid Mosque in Miami, Florida for the past ten years. As a result of recent reports provided by informants about al Shibh's call for jihad in America, he has been under surveillance. He was photographed on 2 February, 2004, on the University of Miami campus in Coral Gables, distributing literature, written in Arabic, at various locations known to be frequented by Islamic students. This literature describes how well the city of Miami illustrates that America has become a sink of vice and corruption. Examples are provided of the easy availability of sex and drugs in the Miami area. This literature also calls for immediate jihadic action in order to prevent the corruption of Muslims in America. Especially singled out in this literature is the tourist industry in the Miami area..\n", "FBI_21": "Received information from MI 6 about Imad Dahdah, who resides at #65 West End Ave. in Nassau, The Bahamas. Dahdah was born in Syria in 1964 and came to the UK in 1994. He became active in Islamic affairs and regularly attended the Baker St. mosque. He obtained British citizenship in 1998 and travels under a British passport. He traveled to Afghanistan in 1999 - 2000 and is now suspected of having been trained at an Al Qaeda facility during this time. Dahdah returned to the UK in March of 2000 but left for The Bahamas in June of 2000. He works at an auto repair shop for a minimum wage but is now known to receive periodic funds from an account at the Gulf Shores Bank in Tampa, FL. The account from which these funds are drawn belongs to an organization named Middle Eastern Charities..\n", "FBI_28": "Information was requested of Belgian intelligence by the FBI on 1 September about Pieter Dopple, who lives at 22 Hoveniersstraat, Antwerp, Belgium. He sent the diamonds to Adnan Hijazi as noted in the USCBP report of 12 July, 2004. Belgian intelligence reports that Dopple has been under surveillance as a fence for diamonds obtained by groups, many of them associated with Islamic ventures, in various places in Africa. It appears that Dopple receives raw diamonds and other precious stones such as tanzanite and cuts and polishes them for distribution. Dopple receives a fee for his services but does not sell the stones himself. He sends them where his suppliers specify. At his interrogation, Dopple admitted that he was part of a scheme for transferring funds for militant Islamic groups and agreed to cooperate with investigators. He listed several persons in addition to Hijazi to whom he had sent polished diamonds and tanzanite. One person he named was Ramundo Ortiz, who runs a business in Panama City, Panama. He further said that he had just sent about $150,000 in polished diamonds to Ortiz on 25 September. Asked for the identity of the person(s) who had requested this transaction, he could only say that they were from Peshawar in Pakistan..\n", "NSA_07": "Intercepted phone call from a location in Karachi, Pakistan to a location in Panama City, Panama. The location in Karachi is # 631 Nishtar Rd; the location in Panama City is 993 Panamico Ave. The caller says [in English]: \"Can you help us sell a large assortment of very high quality tanzanite in a short time?\" The person receiving the call says: \"Yes, will the money go to the usual place?\" The caller replies: \"Yes, for this shipment, but the money from other shipments may go to other places; we will let you know.\"..\n"}